*&---------------------------------------------------------------------*
*& Report ZRSA11_11
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zrsa11_11.

DATA: gv_a TYPE sy-datum,
      gv_b LIKE gv_a,
      gv_c LIKE gv_a,
      gv_d LIKE gv_a.

*gv_a = sy-datum + 7.
"Cal Date
PERFORM cal_date USING sy-datum '7'
                 CHANGING gv_a.       "sy-datum 변수의 값을 던져준다. + 바뀌는 값 '7' 을 던져준다

PERFORM cal_date USING sy-datum '14'
                 CHANGING gv_b.

PERFORM cal_date_new USING sy-datum '21'
                     CHANGING gv_c.

*gv_a = sy-datum + 7.
*gv_b = sy-datum + 14.
*gv_c = sy-datum + 21.
gv_d = sy-datum + 28.

PERFORM display_info.

*&---------------------------------------------------------------------*
*& Form cal_date
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal_date USING value(p_date)
                    VALUE(p_days)
              CHANGING VALUE(p_new_date). " 위에서 던진 sy-datum 변수값을 p_date로 받는다! 바뀌는 값인 '7'은 p_days로 받음!
 p_new_date = p_date + p_days.
ENDFORM.


*&---------------------------------------------------------------------*
*& Form cal_date_new
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*&      --> SY_DATUM
*&      --> P_
*&      <-- GV_C
*&---------------------------------------------------------------------*
FORM cal_date_new  USING    p_datum             "자동으로 call by reference로 만들어짐,,,using을 사용했음에도 불구하고.
                            VALUE(p_days)
                   CHANGING p_new_date.

ENDFORM.


*&---------------------------------------------------------------------*
*& Form display_info
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM display_info .
  WRITE: gv_a, gv_b, gv_c, gv_d.
ENDFORM.
