*&---------------------------------------------------------------------*
*& Report ZRSA11_10
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zrsa11_10.

DATA: gv_a TYPE i,
      gv_b LIKE gv_a,
      gv_r LIKE gv_b.

gv_a = 10.
gv_b = 20.

* Subroutine (있다가 사라지는 서브루틴은 로컬 변수!)
*PERFORM cal. "호출한다
PERFORM cal USING gv_a gv_b
            CHANGING gv_r.
"gv_a & gv_b를 서브루틴으로 보낼꺼야. (보냈으니까 받는 액션도 필요. 받는 애는 파라미터 변수!)
" 값을 계산했으면 gv_r로 값을 다시 보내줘!

WRITE gv_r.
*&---------------------------------------------------------------------*
*& Form cal
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
         "p_a & p_b 파라미터 변수로 받는다!
FORM cal USING VALUE(p_a)
               VALUE(p_b)
      CHANGING VALUE(p_r). "서브루틴으로 계산한 값으로 원본 gv_r로 바꾸고 싶어! (changing value)
  p_r = p_a + p_b.
ENDFORM.
